'''2) Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.'''

def input_to_string(a, b, c, d, e, f):
    print(f'Пользователь: {a} {b} {c}г.р., г.{d}, email: {e}, телефон: {f}')
    
input_to_string(e = 'pirog.v@ya.ru', a = 'Василий', b = 'Пирожков', c = '1984', d = 'Бобруйск', f = '88005678432')

