"""5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2]."""

def my_rates(dd, us_input):
    max_val = max(dd)
    if us_input > max_val:
        dd.insert(0,us_input)
    elif us_input in dd:
        dd.insert(-dd[::-1].index(us_input), us_input)
    else:
        dd.append(us_input)
        
my_list = [7, 5, 3, 3, 2]
my_rates(my_list, 77)
my_rates(my_list, 6)
my_rates(my_list, 4)
my_rates(my_list, 4)
my_rates(my_list, 5)
print(my_list)
