"""
6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена, количество, единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}), 
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""
production_tmpl = {
    'название' : ("Наименование", str),
    'цена' : ('стоимость', int),
    'количество' : ('количество', int),
    'ед' : ('ед/мзм (шт)', str)
}

next_enter = True

auto_inc = 1  # инкрементирование — операция, увеличивающая переменную. 
items_list = []

while next_enter:
    item = {}
    for key, value in production_tmpl.items():
        while True:
            user_value = input(f'{value[0]}\n')
            try:
                user_value = value[1](user_value)  # int (user_value)
            except ValueError as e:
                print(f'{e}\nWrong input type')
                continue
            item[key] = user_value
            break
    items_list.append((auto_inc, item))
    auto_inc += 1

    while True:
        choise = input("Добавить позицию? да/нет\n")
        if choise.lower() in ('да' , 'нет'):
            next_enter = choise.lower() == 'да'
            break
        else:
            print('Невверный ввод, повторите')

print(items_list)
