"""
1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""
#Создать список и заполнить его элементами различных типов данных.
a_list = ["jdkshfkjh",4,14.314,8,90,"hi",3.5687,True,"False"]
print(type(a_list))

#проверка типа данных каждого элемента. 
for element in range(len(a_list)):
    print(type(a_list[element]))