'''5. Реализовать класс Stationery (канцелярская принадлежность). Определить в нем атрибут title (название) и метод draw (отрисовка). Метод выводит сообщение “Запуск отрисовки.” Создать три дочерних класса Pen (ручка), Pencil (карандаш), Handle (маркер). В каждом из классов реализовать переопределение метода draw. Для каждого из классов методы должен выводить уникальное сообщение. Создать экземпляры классов и проверить, что выведет описанный метод для каждого экземпляра.
'''
class Stationery:
    ''' (канцелярская принадлежность). '''
    title = "название" 
    def draw(self):
        '''(отрисовка). Метод выводит сообщение “Запуск отрисовки.” '''
        print("“Запуск отрисовки.”")
        
#Создать три дочерних класса 
class Pen(Stationery): 
    '''(ручка) 
    переопределение метода draw.    '''
    def draw(self, item = "ручка"):
        print(f"“Запуск отрисовки:\n item 1 = {item} ”")

class Pencil(Stationery): 
    '''(карандаш) 
    переопределение метода draw. '''
    def draw(self, item = "карандаш"):
        print(f"“Запуск отрисовки:\n item 2 = {item} ”")


class Handle(Stationery): 
    ''' (маркер) 
    переопределение метода draw. '''
    def draw(self, item = "маркер"):
        print(f"“Запуск отрисовки:\n item 2 = {item} ”")

        
'''        Создать экземпляры классов и проверить, 
        что выведет описанный метод для каждого экземпляра.'''

stationery = Stationery()
stationery.draw()

pen = Pen()
pencil = Pencil()
handle = Handle()

pen.draw('square')
pencil.draw('round')
handle.draw('triangle')