'''6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.'''

'''Например: a = 2, b = 3.
Результат:
1-й день: 2
2-й день: 2,2
3-й день: 2,42
4-й день: 2,66
5-й день: 2,93
6-й день: 3,22
Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.'''

def input_integer():
    # Проверяет ввод, возвращает введенное число 
    # Дает возможность повторить ввод при ошибке
    while True:
        _input = input()   
        if _input.isdigit():
            _input = int(_input)
            return _input
        else:
            print('Error! signature you have typed is not a number!\n')

day_count = 1

a_km = input_integer()  #В первый день его результат составил a километров. 
b_km = input_integer() 

while a_km < b_km:     #Определим номер дня, на который общий результат спортсмена составить не менее b километров. 
    print(f'{day_count}-й день: {round(a_km,2)}')
    a_km = a_km * 1.1  #Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. 
    day_count += 1

print(f'{day_count}-й день: {round(a_km,2)}')
print(f'Ответ: на {day_count}-й день спортсмен достиг результата — не менее {round(b_km,0)} км')#выводить одно натуральное число — номер дня.
