"""5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2]."""

def my_rates(dd, value):
    max_value = max(dd)
    if value > max_value:
        dd.insert(0,value)
    elif value in dd:
        print(f'(-dd[::-1].index(value)')
        print(-dd[::-1].index(value))
        dd.insert(-dd[::-1].index(value), value)
    else:
        dd.append(value)
        
my_list = [7, 5, 3, 3, 2]
print(my_list)
my_rates(my_list, 77)
print(my_list)
my_rates(my_list, 6)
print(my_list)
