'''UNDER CONSTRUCTION'''
'''5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке). Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.'''

def input_integer():
    # Проверяет ввод, возвращает введенное число 
    # Дает возможность повторить ввод при ошибке
    while True:
        _input = input('\nEnter a number:\n')   
        if _input.isdigit():
            _input = int(_input)
            return _input
        else:
            print('Error! signature you have typed is not a number!')

print('укажите объем выручки:\n')
revenue = input_integer() # Выручка
print('укажите объем издержек:\n')
cost = input_integer() # Издержки
# Прибыль = выручка - издержки
profit = revenue - cost

if revenue < cost:
    print('убыток — издержки больше')
else:
    print('прибыль — выручка больше издержек') 
    # Рентабельность = выручка/прибыль
    profitability = revenue / profit
    # Запрос числа сотрудников
    print('укажите количество сотрудников:')
    staff = input_integer()
    # Вычислить прибыль / число сотрудников
    print('На одного сотрудника прибыль составляет\n')
    print((profit / staff) + " у.е.\n")
    print(f'а рентабельность составляет {profitability} у.е.')


