'''6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл. Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
'''
from itertools import count as i_count
from itertools import cycle as i_cycle

c = 0
for el in i_cycle([50, 100, 170]): 
    print(f'{c} = с')
    if abs(c) > 20:
        exit('c > 20')
    print(el + c)
    count_num = el
    for element in i_count(count_num, -11):
        if element % 2 == 0:
            print(f' {element} % 2 == 0  check')
        elif element < 0:
            print(f'success 0 over {count_num}')
            break
        else:
            print(element)
    c += 1
